
# Загрузить цветное изображение.
# Выполнить свертку с фильтром, придающим рельеф с каждым из цветовых
# каналов изображения. Ядро преобразования можно найти по ссылке:
# https://docs.gimp.org/2.8/ru/plug-in-convmatrix.html 
# Сохранить результат в файл.


import logging
import numpy as np

from mygpu import print_info, convert

logging.basicConfig(level=logging.DEBUG)

print_info()

convert('../images/500x321.png', './output/test.png')


test = np.array([
    [[1,0,1,1], [0,1,1,1], [1,1,0,1], [1,0,0,1], [0,0,1,1],],
    [[1,0,1,1], [0,1,1,1], [1,1,0,1], [1,0,0,1], [0,0,1,1],],
    [[1,0,1,1], [0,1,1,1], [1,1,0,1], [1,0,0,1], [0,0,1,1],],
    [[1,0,1,1], [0,1,1,1], [1,1,0,1], [1,0,0,1], [0,0,1,1],],
    [[1,0,1,1], [0,1,1,1], [1,1,0,1], [1,0,0,1], [0,0,1,1],],
])
